<h1> Problem Set 2 </h1>

<h2> Question 1</h2>

In [15]:
a = 0 #value of a is set to 0
 
def b(): 
    global a # a is declared as global in order to modify
    a = c(a) # here, initially a is set to 0
 
def c(a): #c is defined
    return a + 2

b() #here, the value of a will be 0 + 2 = 2. 'a' is now updated to 2.
b() #here, the value of a will be 2 + 2 = 4. 'a' is now updated to 4.
b() #here, the value of a will be 4 + 2 = 6. 'a' is now updated to 6.
print(a)

6

<h4> Explanation <h4>

In the first execution of b(), first the b is called, which calles c(a). Initially the value of a is set to 0 and the resulting output is 0+2=2.

In the first execution of b(), first the b is called, which calles c(a). Now, as the value of a is 2, the resulting output is 2+2=4.

In the first execution of b(), first the b is called, which calles c(a). Now, as the value of a is 4, the resulting output is 4+2=6..

<h2>Question 2</h2>

In [118]:
def fileLength(filename):
    try:
        with open(filename, 'r') as infile:
            contents = infile.read()
            return len(contents)
    except FileNotFoundError:
        print(f"File {filename} not found.")

In [132]:
fileLength("C:/Users/pruth/OneDrive/Desktop/BDAT/Sem 1/Data Analytics Programming/Problem Set 2/Filelength.txt")

123

In [130]:
fileLength("C:/Users/pruth/OneDrive/Desktop/BDAT/Sem 1/Data Analytics Programming/Problem Set 2/Filelengt.txt")

File C:/Users/pruth/OneDrive/Desktop/BDAT/Sem 1/Data Analytics Programming/Problem Set 2/Filelengt.txt not found.

<h2>Question 3</h2>

<h3>Marsupial Class</h3>

In [98]:
class Marsupial:
    def __init__(self):
        self.pouch = [] #list to store pouch contents

    def put_in_pouch(self, item):
        self.pouch.append(item) # adding items to pouch list

    def pouch_contents(self):
        return self.pouch #returns the list of items in the pouch

m = Marsupial() # creating a marsupial object
m.put_in_pouch('doll') # adding doll in the pouch
m.put_in_pouch('firetruck') # adding firetruck in the pouch
m.put_in_pouch('kitten') # adding kitten in the pouch

print(m.pouch_contents())

['doll', 'firetruck', 'kitten']

<h3>Kangaroo Subclass</h3>

In [102]:
class Kangaroo(Marsupial):
    def __init__(self, x, y):
        super().__init__()  # initialize marsupial
        self.x = x # initialize coordinates
        self.y = y

    def jump(self, dx, dy):
        self.x += dx # move coordinates by dx
        self.y += dy # move coordinates by dy

    def __str__(self):
        return f"I am a Kangaroo located at coordinates ({self.x},{self.y})"

k = Kangaroo(0, 0)
print(k)

k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
print(k.pouch_contents())

k.jump(1, 0)
k.jump(1, 0)
k.jump(1, 0)
print(k)

I am a Kangaroo located at coordinates (0,0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (3,0)

<h2>Question 4</h2>

In [81]:
def collatz(x):
    print(x) # current value of x
    
    if x == 1: # if value of x is 1, then stop
        return
    if x % 2 == 0:
        collatz(x // 2)  # if value of x is even, divide it by 2
    else:
        collatz(3 * x + 1)  # if value of x is odd, multiply it by 3 and add 1

collatz(1)
collatz(10)

1
10
5
16
8
4
2
1

<h2>Question 5</h2>

In [72]:
def binary(n):
    if n == 0: # if n is 0, print 0, end= to ensure output is in same line
        print(0, end='')
    elif n == 1: # if n is 1, print 1
        print(1, end='')
    else:
        binary(n // 2) # divide by 2 and call quotient
        print(n % 2, end='') #printing the remainder after the recursive call

binary(0)
print()

binary(1)
print()

binary(3)
print()

binary(9)
print()

0
1
11
1001

<h1>Question 6</h2>

In [15]:
from html.parser import HTMLParser

class HeadingParser(HTMLParser):
    def __init__(self):
        super().__init__()
        self.in_heading = False
        self.indent_level = 0 # it is a variable to store the current indentation level

    def handle_starttag(self, tag, attrs):
        if tag in ['h1', 'h2', 'h3', 'h4', 'h5', 'h6']: # check if it is a heading tag
            self.in_heading = True
            self.indent_level = int(tag[1]) - 1 # based on the heading tag, indentation is checked

    def handle_endtag(self, tag):
        if tag in ['h1', 'h2', 'h3', 'h4', 'h5', 'h6']: #if it is a heading tag, it resets the flag
            self.in_heading = False

    def handle_data(self, data):
        if self.in_heading: #print with appropriate indentation
            print(' ' * self.indent_level + data.strip())


infile = open('C:/Users/pruth/OneDrive/Desktop/BDAT/Sem 1/Data Analytics Programming/Problem Set 2/w3c.html')
content = infile.read()
infile.close()
hp = HeadingParser()
hp.feed(content)

W3C Mission
 Principles

<h2>Question 7</h2>

In [136]:
import requests
from bs4 import BeautifulSoup
from urllib.parse import urljoin

def webdir(url, depth, indent):
    if depth < 0:   # if value of depth is 0, print the url plus stop recursion
        return
    
    print(" " * indent + url)  # print the current url
    try:
       
        response = requests.get(url)  # send http get request
        response.raise_for_status()  # check for http error

        soup = BeautifulSoup(response.text, 'html.parser')   # parse the html content
        links = soup.find_all('a', href=True)
        
        for link in links:
            new_url = urljoin(url, link['href'])
            webdir(new_url, depth - 1, indent + 4)  # call webdir with depth reduced by 1 and increased indentation
            
    except requests.exceptions.RequestException as e:
        print(" " * (indent + 4) + f"Error: {e}")

webdir('http://reed.cs.depaul.edu/lperkovic/csc242/test1.html', 2, 0)

http://reed.cs.depaul.edu/lperkovic/csc242/test1.html
    Error: 404 Client Error:  for url: http://reed.cs.depaul.edu/lperkovic/csc242/test1.html

<h2>Question 8</h2>

In [108]:
import sqlite3

conn = sqlite3.connect(":memory:") # connecting to database
cursor = conn.cursor()

cursor.execute('''
    CREATE TABLE Weather (
        City TEXT,
        Country TEXT,
        Season TEXT,
        Temperature REAL,
        Rainfall REAL
    )
''') # created the table

data = [
    ('Mumbai', 'India', 'Winter', 24.8, 5.9),
    ('Mumbai', 'India', 'Spring', 28.4, 16.2),
    ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
    ('Mumbai', 'India', 'Fall', 27.6, 346.0),
    ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
    ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
    ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
    ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
    ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
    ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
    ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
    ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)
]

cursor.executemany('INSERT INTO Weather VALUES (?, ?, ?, ?, ?)', data)
conn.commit()

In [87]:
import pandas as pd # to display output in table format

<h3>All the temperature data. </h3>

In [89]:
query = "SELECT Temperature FROM Weather"
df_a = pd.read_sql_query(query, conn)
display(df_a)

    Temperature
0          24.8
1          28.4
2          27.9
3          27.6
4           4.2
5           8.3
6          15.7
7          10.4
8          13.6
9          20.7
10         27.7
11         22.2

<h3>All the cities, but without repetition.<h3>

In [92]:
query = "SELECT DISTINCT City FROM Weather"
df_b = pd.read_sql_query(query, conn)
display(df_b)

     City
0  Mumbai
1  London
2   Cairo

<h3>All the records for India. </h3>

In [94]:
query = "SELECT * FROM Weather WHERE Country = 'India'"
df_c = pd.read_sql_query(query, conn)
display(df_c)

     City Country  Season  Temperature  Rainfall
0  Mumbai   India  Winter         24.8       5.9
1  Mumbai   India  Spring         28.4      16.2
2  Mumbai   India  Summer         27.9    1549.4
3  Mumbai   India    Fall         27.6     346.0

<h3>All the Fall records.</h3>

In [96]:
query = "SELECT * FROM Weather WHERE Season = 'Fall'"
df_d = pd.read_sql_query(query, conn)
display(df_d)

     City         Country Season  Temperature  Rainfall
0  Mumbai           India   Fall         27.6     346.0
1  London  United Kingdom   Fall         10.4     218.5
2   Cairo           Egypt   Fall         22.2       4.5

<h3>The city, country, and season for which the average rainfall is between 200 
and 400 millimeters. </h3>

In [98]:
query = """
    SELECT City, Country, Season 
    FROM Weather 
    WHERE Rainfall BETWEEN 200 AND 400
"""
df_e = pd.read_sql_query(query, conn)
display(df_e)

     City         Country  Season
0  Mumbai           India    Fall
1  London  United Kingdom  Winter
2  London  United Kingdom    Fall

<h3>The city and country for which the average Fall temperature is above 20 
degrees, in increasing temperature order. </h3>

In [100]:
query = """
    SELECT City, Country 
    FROM Weather 
    WHERE Season = 'Fall' AND Temperature > 20 
    ORDER BY Temperature ASC
"""
df_f = pd.read_sql_query(query, conn)
display(df_f)

     City Country
0   Cairo   Egypt
1  Mumbai   India

<h3>The total annual rainfall for Cairo.</h3>

In [102]:
query = """
    SELECT City, SUM(Rainfall) AS Total_Rainfall 
    FROM Weather 
    WHERE City = 'Cairo'
"""
df_g = pd.read_sql_query(query, conn)
display(df_g)

    City  Total_Rainfall
0  Cairo            27.6

<h3>The total rainfall for each season.</h3>

In [106]:
query = """
    SELECT Season, SUM(Rainfall) AS Total_Rainfall 
    FROM Weather 
    GROUP BY Season
"""
df_h = pd.read_sql_query(query, conn)
display(df_h)

   Season  Total_Rainfall
0    Fall           569.0
1  Spring           192.3
2  Summer          1706.5
3  Winter           230.1

<h2>Question 9</h2>

In [52]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

uppercase = [word.upper() for word in words]
print(uppercase)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [62]:
lowercase = [word.lower() for word in words]
print(lowercase)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [28]:
word_length = [len(word) for word in words]
print(word_length)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [48]:
word_detail = [[word.upper(), word.lower(), len(word)] for word in words]
print(word_detail)

[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

In [40]:
long_word = [word for word in words if len(word) >= 4]
print(long_word)

['quick', 'brown', 'jumps', 'over', 'lazy']